Ma0.75omega42.5grid1_vis/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    aerofoil
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          300;
        startFace       39600;
    }
    inlet
    {
        type            patch;
        inGroups        List<word> 1(freestream);
        nFaces          400;
        startFace       39900;
    }
    outlet
    {
        type            patch;
        inGroups        List<word> 1(freestream);
        nFaces          100;
        startFace       40300;
    }
    back
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          20000;
        startFace       40400;
    }
    front
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          20000;
        startFace       60400;
    }
)

// ************************************************************************* //
