Ma0.75omega42.5grid1_vis/system/maxCo.00
maxCo           3.0;
