Ma0.75omega42.5grid1_vis/system/maxCo.01
maxCo           4.0;
