Ma0.75omega42.5grid1_vis/system/maxCo.04
maxCo           6.0;
