Ma0.75omega42.5grid1_vis/system/maxCo.05
maxCo           7.0;
