Ma0.75omega42.5grid1_vis/system/writeInterval
writeInterval   0.290;
