Ma0.75omega42.5grid1_vis/system/writeInterval.00
writeInterval   0.001;
