Ma0.75omega42.5grid1_vis/system/writeInterval.01
writeInterval   0.0047569701;
