Ma0.75omega42.5grid1_vis/system/writeInterval.02
writeInterval   0.010403;
