Ma0.75omega42.5grid1_vis/system/writeInterval.03
writeInterval   0.021601314071588;
