Ma0.75omega42.5grid1_vis/system/writeInterval.04
writeInterval   0.027844743516925;
