Ma0.75omega42.5grid1_vis/system/writeInterval.05
writeInterval  0.046075083626365;
