Ma0.75omega42.5grid1_vis/system/writeInterval.06
writeInterval   0.0523;
