Ma0.75omega42.5grid1_vis/system/writeInterval.08
writeInterval   0.0691;
