Ma0.75omega42.5grid1_vis/system/writeInterval.12
writeInterval   0.104;
