Ma0.75omega42.5grid1_vis/system/writeInterval.13
writeInterval   0.116;
