Ma0.75omega42.5grid1_vis/system/writeInterval.15
writeInterval   0.135;
