Ma0.75omega42.5grid1_vis/system/writeInterval.16
writeInterval   0.142;
