Ma0.75omega42.5grid1_vis/system/writeInterval.17
writeInterval   0.152;
