Ma0.75omega42.5grid1_vis/system/writeInterval.18
writeInterval   0.158;
