Ma0.75omega42.5grid1_vis/system/writeInterval.19
writeInterval   0.169;
