Ma0.75omega42.5grid1_vis/system/writeInterval.20
writeInterval  0.175;
