Ma0.75omega42.5grid1_vis/system/writeInterval.21
writeInterval   0.193;
