Ma0.75omega42.5grid1_vis/system/writeInterval.22
writeInterval   0.200;
