Ma0.75omega42.5grid1_vis/system/writeInterval.24
writeInterval   0.217;
