Ma0.75omega42.5grid1_vis/system/writeInterval.25
writeInterval   0.227;
