Ma0.75omega42.5grid1_vis/system/writeInterval.26
writeInterval   0.234;
