Ma0.75omega42.5grid1_vis/system/writeInterval.27
writeInterval   0.243;
