Ma0.75omega42.5grid1_vis/system/writeInterval.28
writeInterval   0.252;
