Ma0.75omega42.5grid1_vis/system/writeInterval.30
writeInterval   0.273;
