Ma0.75omega42.5grid1_vis/system/writeInterval.31
writeInterval   0.283;
