Ma0.75omega42.5grid1_vis/system/writeInterval.32
writeInterval   0.290;
